# SQL Murder Mystery

## Can you find out whodunnit?

![A decorative illustration of a detective looking at an evidence board.](https://mystery.knightlab.com/174092-clue-illustration.png)

There's been a Murder in SQL City! The SQL Murder Mystery is designed to be both a self-directed lesson to learn SQL concepts and commands and a fun game for experienced SQL users to solve an intriguing crime.

## SQL sleuths start here

A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a **​murder​**that occurred sometime on ​**Jan.15, 2018​** and that it took place in ​**SQL City​**. Start by retrieving the corresponding crime scene report from the police department’s database.

### Exploring the Database Structure

Experienced SQL users can often use database queries to infer the structure of a database. But each database system has different ways of managing this information. The SQL Murder Mystery is built using SQLite. Use this SQL command to find the tables in the Murder Mystery database.

Run this query to find the names of the tables in this database.

This command is specific to SQLite. For other databases, you'll have to learn their specific syntax.

In [1]:
# Install required packages
%pip install ipython-sql sqlalchemy pandas --quiet

# Load SQL magic
%load_ext sql

# Connect to the database
%sql sqlite:///sql-murder-mystery.db

%pip install prettytable==3.7.0

Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: prettytable==3.7.0 in /home/codespace/.python/current/lib/python3.12/site-packages (3.7.0)
Requirement already satisfied: wcwidth in /home/codespace/.local/lib/python3.12/site-packages (from prettytable==3.7.0) (0.2.13)
Note: you may need to restart the kernel to use updated packages.

In [2]:
%%sql
SELECT name
FROM sqlite_master
where type = 'table';

 * sqlite:///sql-murder-mystery.db
Done.

[('crime_scene_report',),
 ('drivers_license',),
 ('facebook_event_checkin',),
 ('interview',),
 ('get_fit_now_member',),
 ('get_fit_now_check_in',),
 ('solution',),
 ('income',),
 ('person',)]


Besides knowing the table names, you need to know how each table is structured. The way this works is also dependent upon which database technology you use. Here's how you do it with SQLite.

Run this query to find the structure of the `crime_scene_report` table

Change the value of 'name' to see the structure of the other tables you learned about with the previous query.

In [3]:
%%sql
SELECT sql
FROM sqlite_master
where name = 'crime_scene_report'

 * sqlite:///sql-murder-mystery.db
Done.

[('CREATE TABLE crime_scene_report (\n        date integer,\n        type text,\n        description text,\n        city text\n    )',)]

In [4]:
%%sql
SELECT *
FROM crime_scene_report
WHERE date = 20180115
  AND type = 'murder'
  AND city = 'SQL City';

 * sqlite:///sql-murder-mystery.db
Done.

[(20180115, 'murder', 'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".', 'SQL City')]

In [5]:
%%sql
SELECT id, name
FROM person
WHERE name = 'Annabel Miller';


SELECT id, name
FROM person
WHERE name = 'Morty Schapiro';

 * sqlite:///sql-murder-mystery.db
Done.
Done.

[(14887, 'Morty Schapiro')]

In [6]:
%%sql
SELECT *
FROM interview
WHERE person_id = 14887;

-- and

SELECT *
FROM interview
WHERE person_id = 16371;

 * sqlite:///sql-murder-mystery.db
Done.
Done.

[(16371, 'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.')]

In [7]:
%%sql
SELECT *
FROM get_fit_now_member
WHERE id LIKE '48Z%';

 * sqlite:///sql-murder-mystery.db
Done.

[('48Z38', 49550, 'Tomas Baisley', 20170203, 'silver'),
 ('48Z7A', 28819, 'Joe Germuska', 20160305, 'gold'),
 ('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold')]

In [8]:
%%sql
SELECT *
FROM get_fit_now_check_in
WHERE membership_id IN ('48Z7A', '48Z55') -- update based on previous result
  AND check_in_date = 20180109;

 * sqlite:///sql-murder-mystery.db
Done.

[('48Z7A', 20180109, 1600, 1730), ('48Z55', 20180109, 1530, 1700)]

In [9]:
%%sql
SELECT *
FROM person
WHERE id IN (28819, 67318);  -- use actual person_id(s)

 * sqlite:///sql-murder-mystery.db
Done.

[(28819, 'Joe Germuska', 173289, 111, 'Fisk Rd', '138909730'),
 (67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', '871539279')]

In [10]:
%%sql
SELECT *
FROM drivers_license
WHERE plate_number LIKE '%H42W%';

 * sqlite:///sql-murder-mystery.db
Done.

[(183779, 21, 65, 'blue', 'blonde', 'female', 'H42W0X', 'Toyota', 'Prius'),
 (423327, 30, 70, 'brown', 'brown', 'male', '0H42W2', 'Chevrolet', 'Spark LS'),
 (664760, 21, 71, 'black', 'black', 'male', '4H42WR', 'Nissan', 'Altima')]

In [11]:
%%sql
SELECT *
FROM person
WHERE license_id IN (423327, 664760); -- use license ids from above

 * sqlite:///sql-murder-mystery.db
Done.

[(51739, 'Tushar Chandra', 664760, 312, 'Phi St', '137882671'),
 (67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', '871539279')]

In [12]:
%%sql
SELECT *
FROM facebook_event_checkin
WHERE event_name = 'SQL Symphony Concert'
  AND person_id IN (28819, 67318);  -- the narrowed suspects

 * sqlite:///sql-murder-mystery.db
Done.

[(67318, 1143, 'SQL Symphony Concert', 20171206)]

In [13]:
%%sql
SELECT *
FROM person
WHERE id = 67318;

 * sqlite:///sql-murder-mystery.db
Done.

[(67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', '871539279')]


### The rest is up to you!

If you're really comfortable with SQL, you can probably get it from here. To help, here is the schema diagram:

![schema diagram](schema.png)

Use your knowledge of the database schema and SQL commands to find out who committed the murder.
### Check your solution

Did you find the killer? When you think you know the answer, submit your suspect using the following code and find out if you're right.

In [14]:
%%sql
INSERT INTO solution VALUES (1, 'Jeremy Bowers');
SELECT value FROM solution;

 * sqlite:///sql-murder-mystery.db
1 rows affected.
Done.

[("Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murd ... (88 characters truncated) ... r SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer.",)]